Revit 2025 API
ElectricalSystem.WireType Property
 The wire type of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public WireType WireType { get; set; }
Public Property WireType As WireType
	Get
	Set
public:
property WireType^ WireType {
	WireType^ get ();
	void set (WireType^ value);
}
member WireType : WireType with get, set
Property Value
WireType
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 This property is used to retrieve the wire type of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace